Revit 2027 API
ParameterTypeId.DesignOptionId Property
 "Design Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DesignOptionId { get; }
Public Shared ReadOnly Property DesignOptionId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DesignOptionId {
	ForgeTypeId^ get ();
}
static member DesignOptionId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace